ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_smif_memslot.c
/***************************************************************************//**
* \file cy_smif_memslot.c
* \version 1.30
*
* \brief
*  This file provides the source code for the memory-level APIs of the SMIF driver.
*
* Note:
*
********************************************************************************
* \copyright
* Copyright 2016-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_smif_memslot.h"

#ifdef CY_IP_MXSMIF

#if defined(__cplusplus)
extern "C" {
#endif

/** \cond INTERNAL */
/***************************************
*     Internal Constants
***************************************/

#define READ_ENHANCED_MODE_DISABLED (0xFFU)
#define BITS_IN_BYTE               (8U)
#define BYTES_IN_DWORD             (4U)
#define BITS_IN_BYTE_ABOVE_4GB     (3U)     /** Density of memory above 4GBit stored as poser of 2 */
#define PARAM_HEADERS_NUM          (CY_SMIF_SFDP_BFPT_BYTE_06)
#define FIRST_HEADER_OFFSET        (0x08U)  /** The offset of the 1-st Parameter Header */
#define PARAM_ID_MSB_REL_OFFSET    (0x07U)  /** The relative offset of Parameter ID MSB 
                                                          * in the SFDP Header table 
                                                          */
#define PARAM_MINOR_REV_REL_OFFSET (0x01U)  /** The relative offset of Parameter Minor Revision 
                                                          * in the SFDP Header table 
                                                          */
#define PARAM_MAJOR_REV_REL_OFFSET (0x02U)  /** The relative offset of Parameter Major Revision
                                                          * in the SFDP Header table
                                                          */
#define PARAM_ID_MSB_OFFSET        (0x08U)  /** The offset of Parameter ID MSB */
#define PARAM_ID_LSB_MASK          (0xFFUL) /** The mask of Parameter ID LSB */
#define PARAM_TABLE_PRT_OFFSET     (0x04UL) /** The relative offset of Parameter Table Pointer Byte 1 */
#define PARAM_TABLE_LENGTH_OFFSET  (0X03U)  /** The offset of Parameter Table Length in the Header Table */
#define PARAM_HEADER_NUM           (6U)     /** The supported number of the parameter headers */
#define HEADER_LENGTH              (0x8U)   /**< The length of the SFDP header */
#define HEADERS_LENGTH             (HEADER_LENGTH + \
                                                 (CY_SMIF_SFDP_PARAM_HEADER_LENGTH * PARAM_HEADER_NUM))
#define TYPE_STEP                  (2UL)     /** The Erase Type step in the Basic Flash Parameter Table */
#define INSTRUCTION_NOT_SUPPORTED  (0XFFU)  /** The code for the not supported instruction */
#define BASIC_SPI_ID_LSB           (0X00UL) /** The JEDEC SFDP Basic SPI Flash Parameter ID LSB */
#define BASIC_SPI_ID_MSB           (0XFFUL) /** The JEDEC SFDP Basic SPI Flash Parameter ID MSB */
#define ERASE_T_COUNT_Pos          (0UL)    /**< Erase Type X Erase, Typical time: count (Bits 4:0) */
#define ERASE_T_COUNT_Msk          (0x1FUL) /**< Erase Type X Erase, Typical time: count (Bitfield-Mask) */
#define ERASE_T_UNITS_Pos          (5UL)    /**< Erase Type X Erase, Typical time: units (Bits 6:5) */
#define ERASE_T_UNITS_Msk          (0x60UL) /**< Erase Type X Erase, Typical time: units (Bitfield-Mask) */
#define ERASE_T_COUNT_OFFSET       (0x04U)  /** The offset of the Erase count 10th DWORD */
#define ERASE_T_LENGTH             (0x07U)  /** The Erase Type Typical time length */
#define COMMAND_IS_NOT_FOUND       (0x0U) 
#define PARAMETER_IS_NOT_FOUND     (0x0U)

#define MEM_ADDR_VALID(addr, size)  (0U == ((addr)%(size)))  /* This address must be a multiple of 
                                                                      * the SMIF XIP memory size 
                                                                      */
#define MEM_MAPPED_SIZE_VALID(size) (((size) >= 0x10000U) && (0U == ((size)&((size)-1U))) )
#define MEM_ADDR_SIZE_VALID(addrSize)   ((0U < (addrSize)) && ((addrSize) <= 4U))

/** \endcond*/

/***************************************
*     Internal Function Prototypes
***************************************/
static void XipRegInit(SMIF_DEVICE_Type volatile *dev,
                            cy_stc_smif_mem_config_t const * memCfg);
static cy_en_smif_status_t SfdpReadBuffer(SMIF_Type *base, 
                                         cy_stc_smif_mem_cmd_t const *cmdSfdp,
                                         uint8_t const sfdpAddress[],
                                         cy_en_smif_slave_select_t  slaveSelect,
                                         uint32_t size,
                                         uint8_t sfdpBuffer[],
                                         cy_stc_smif_context_t *context);
static uint32_t SfdpFindParameterHeader(uint32_t id, uint8_t const sfdpBuffer[]);
static cy_en_smif_status_t SfdpFindParameterTableAddress(uint32_t id,
                                                     uint8_t const sfdpBuffer[],
                                                     uint8_t address[],
                                                     uint32_t *tableLength);
static uint32_t SfdpGetNumOfAddrBytes(uint8_t const sfdpBuffer[]);
static uint32_t SfdpGetMemoryDensity(uint8_t const sfdpBuffer[]);
static void SfdpGetReadCmd_1_4_4(uint8_t const sfdpBuffer[], 
                             cy_stc_smif_mem_cmd_t* cmdRead);
static void SfdpGetReadCmd_1_1_4(uint8_t const sfdpBuffer[], 
                             cy_stc_smif_mem_cmd_t* cmdRead);
static void SfdpGetReadCmd_1_2_2(uint8_t const sfdpBuffer[], 
                             cy_stc_smif_mem_cmd_t* cmdRead);
static void SfdpGetReadCmd_1_1_2(uint8_t const sfdpBuffer[], 
                             cy_stc_smif_mem_cmd_t* cmdRead);
static void SfdpGetReadCmd_1_1_1(uint8_t const sfdpBuffer[], 
                             cy_stc_smif_mem_cmd_t* cmdRead);
static void SfdpGetReadCmdParams(uint8_t const sfdpBuffer[], 
                                      cy_en_smif_data_select_t dataSelect, 
                                      cy_stc_smif_mem_cmd_t* cmdRead);
static uint32_t SfdpGetPageSize(uint8_t const sfdpBuffer[]);
static uint32_t SfdpGetEraseTime(uint32_t const eraseOffset, uint8_t const sfdpBuffer[]);
static uint32_t SfdpGetChipEraseTime(uint8_t const sfdpBuffer[]);
static uint32_t SfdpGetPageProgramTime(uint8_t const sfdpBuffer[]);
static void SfdpSetWriteEnableCommand(cy_stc_smif_mem_cmd_t* cmdWriteEnable);
static void SfdpSetWriteDisableCommand(cy_stc_smif_mem_cmd_t* cmdWriteDisable);
static void SfdpSetProgramCommand(cy_stc_smif_mem_cmd_t* cmdProgram);
static void SfdpGetQuadEnableParameters(cy_stc_smif_mem_device_cfg_t *device, 
                                    uint8_t const sfdpBuffer[]);
static void SfdpSetChipEraseCommand(cy_stc_smif_mem_cmd_t* cmdChipErase);
static uint32_t SfdpGetSectorEraseCommand(cy_stc_smif_mem_cmd_t* cmdSectorErase, 
                                   uint8_t const sfdpBuffer[]);
static void SfdpSetWipStatusRegisterCommand(cy_stc_smif_mem_cmd_t* readStsRegWipCmd);


