ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_smif_memslot.c
/*******************************************************************************
* Function Name: SfdpGetReadCmdParams
****************************************************************************//**
*
* Reads the read command parameters from the JEDEC basic flash parameter table. 
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param dataSelect
* The data line selection options for a slave device.
*
* \param cmdRead
* The pointer to the read command parameters structure.
*
*******************************************************************************/
static void SfdpGetReadCmdParams(uint8_t const sfdpBuffer[], 
                             cy_en_smif_data_select_t dataSelect, 
                             cy_stc_smif_mem_cmd_t* cmdRead)
{
    uint32_t sfdpDataIndex = CY_SMIF_SFDP_BFPT_BYTE_02;
    bool quadEnabled = ((CY_SMIF_DATA_SEL1 != dataSelect) &&
                        (CY_SMIF_DATA_SEL3 != dataSelect));

    if (quadEnabled)
    {
        if (1UL == _FLD2VAL(CY_SMIF_SFDP_FAST_READ_1_4_4,
                       ((uint32_t) sfdpBuffer[sfdpDataIndex])))
                       
        {
            SfdpGetReadCmd_1_4_4(sfdpBuffer, cmdRead);
        }
        else if (1UL == _FLD2VAL(CY_SMIF_SFDP_FAST_READ_1_1_4,
                            ((uint32_t)sfdpBuffer[sfdpDataIndex])))
        {
            SfdpGetReadCmd_1_1_4(sfdpBuffer, cmdRead);
        }
        else
        {
            /* Wrong mode */
            CY_ASSERT_L2(true);            
        }
    }
    else
    {
        if ((1UL == _FLD2VAL(CY_SMIF_SFDP_FAST_READ_1_2_2,
                            (uint32_t)sfdpBuffer[sfdpDataIndex])))
        {
            SfdpGetReadCmd_1_2_2(sfdpBuffer, cmdRead);
        }
        else
        {
            if (1UL == _FLD2VAL(CY_SMIF_SFDP_FAST_READ_1_1_2,
                                (uint32_t)sfdpBuffer[sfdpDataIndex]))
            {
                SfdpGetReadCmd_1_1_2(sfdpBuffer, cmdRead);
            }
            else
            {
                SfdpGetReadCmd_1_1_1(sfdpBuffer, cmdRead);
            }
        }
    }
}


/*******************************************************************************
* Function Name: SfdpGetPageSize
****************************************************************************//**
*
* Reads the page size from the JEDEC basic flash parameter table. 
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \return The page size in bytes.
*
*******************************************************************************/
static uint32_t SfdpGetPageSize(uint8_t const sfdpBuffer[])
{
    uint32_t size;

    /* The page size */
    size = 0x01UL << _FLD2VAL(CY_SMIF_SFDP_PAGE_SIZE,
        (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_28]); 
                
    return(size);
}


/*******************************************************************************
* Function Name: SfdpGetEraseTime
****************************************************************************//**
*
* Calculates erase time. 
*
* \param eraseOffset
* The offset of the Sector Erase command in the SFDP buffer.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \return Erase time in us.
*
*******************************************************************************/
static uint32_t SfdpGetEraseTime(uint32_t const eraseOffset, uint8_t const sfdpBuffer[])
{
    /* Get the value of 10th DWORD from the JEDEC basic flash parameter table */
    uint32_t readEraseTime = ((uint32_t*)sfdpBuffer)[CY_SMIF_JEDEC_BFPT_10TH_DWORD];

    uint32_t eraseTimeMax;
    uint32_t eraseTimeIndex = (((eraseOffset - CY_SMIF_SFDP_BFPT_BYTE_1D) + TYPE_STEP) / TYPE_STEP);
    uint32_t eraseUnits = _FLD2VAL(ERASE_T_UNITS, 
                          (readEraseTime >> ((eraseTimeIndex - 1UL) * ERASE_T_LENGTH))
                           >> ERASE_T_COUNT_OFFSET);
    uint32_t eraseCount = _FLD2VAL(ERASE_T_COUNT, 
                          (readEraseTime >> ((eraseTimeIndex - 1UL) * ERASE_T_LENGTH)) 
                          >> ERASE_T_COUNT_OFFSET);
    uint32_t eraseMul = _FLD2VAL(CY_SMIF_SFDP_ERASE_MUL_COUNT, readEraseTime);
    uint32_t eraseMs = 0UL;

    switch (eraseUnits)
    {
        case CY_SMIF_SFDP_UNIT_0:
            eraseMs = CY_SMIF_SFDP_ERASE_TIME_1MS;
            break;
        case CY_SMIF_SFDP_UNIT_1:
            eraseMs = CY_SMIF_SFDP_ERASE_TIME_16MS;
            break;
        case CY_SMIF_SFDP_UNIT_2:
            eraseMs = CY_SMIF_SFDP_ERASE_TIME_128MS;
            break;
        case CY_SMIF_SFDP_UNIT_3:
            eraseMs = CY_SMIF_SFDP_ERASE_TIME_1S;
            break;
        default:
            /* An unsupported SFDP value */
            break;
    }

    /* Convert typical time to max time */
    eraseTimeMax = ((eraseCount + 1UL) * eraseMs) * (2UL * (eraseMul + 1UL));
                
    return(eraseTimeMax);
}


/*******************************************************************************
* Function Name: SfdpGetChipEraseTime
****************************************************************************//**
*
* Calculates chip erase time. 
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \return Chip erase time in us.
*
*******************************************************************************/
static uint32_t SfdpGetChipEraseTime(uint8_t const sfdpBuffer[])
{
    /* Get the value of 10th DWORD from the JEDEC basic flash parameter table */
    uint32_t readEraseTime = ((uint32_t*)sfdpBuffer)[CY_SMIF_JEDEC_BFPT_10TH_DWORD];

    /* Get the value of 11th DWORD from the JEDEC basic flash parameter table */
    uint32_t chipEraseProgTime = ((uint32_t*)sfdpBuffer)[CY_SMIF_JEDEC_BFPT_11TH_DWORD];

    uint32_t chipEraseTimeMax;
    uint32_t chipEraseUnits = _FLD2VAL(CY_SMIF_SFDP_CHIP_ERASE_UNITS, chipEraseProgTime);
    uint32_t chipEraseCount = _FLD2VAL(CY_SMIF_SFDP_CHIP_ERASE_COUNT, chipEraseProgTime);
    uint32_t chipEraseMs = 0UL;
    uint32_t eraseMul = _FLD2VAL(CY_SMIF_SFDP_ERASE_MUL_COUNT, readEraseTime);

