ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_smif_memslot.c
/*******************************************************************************
* Function Name: SfdpSetChipEraseCommand
****************************************************************************//**
*
* Sets the Chip Erase command and the width of the command transfer.
*
* \param cmdChipErase
* The pointer to the Chip Erase command parameters structure.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
*******************************************************************************/
static void SfdpSetChipEraseCommand(cy_stc_smif_mem_cmd_t* cmdChipErase)
{
    /* 8-bit command. Chip Erase */
    cmdChipErase->command  = CY_SMIF_CHIP_ERASE_CMD;
    /* The width of the command transfer */
    cmdChipErase->cmdWidth = CY_SMIF_WIDTH_SINGLE;
}


/*******************************************************************************
* Function Name: SfdpGetSectorEraseCommand
****************************************************************************//**
*
* Sets the Sector Erase command and the width of the command transfer.
*
* \param cmdSectorErase
* The pointer to the Sector Erase command parameters structure.
*
* \return The offset of the Sector Erase command in the SFDP buffer. 
*  Returns 0 when the Sector Erase command is not found.
*
*******************************************************************************/
static uint32_t SfdpGetSectorEraseCommand(cy_stc_smif_mem_cmd_t* cmdSectorErase, 
                                   uint8_t const sfdpBuffer[])
{
    uint32_t eraseOffset = CY_SMIF_SFDP_BFPT_BYTE_1D;
    while (INSTRUCTION_NOT_SUPPORTED == sfdpBuffer[eraseOffset])
    {
        if (eraseOffset >= CY_SMIF_SFDP_BFPT_BYTE_23)
        {
            /* The Sector Erase command is not found */
            eraseOffset = COMMAND_IS_NOT_FOUND;
            break;
        }
        eraseOffset += TYPE_STEP; /* Check the next Erase Type */
    }
    
    /* Get the sector Erase command from the JEDEC basic flash parameter table */
    cmdSectorErase->command = sfdpBuffer[eraseOffset];  

    /* The command transfer width */
    cmdSectorErase->cmdWidth = CY_SMIF_WIDTH_SINGLE;

    /* The address transfer width */
    cmdSectorErase->addrWidth = CY_SMIF_WIDTH_SINGLE;
    
    return(eraseOffset);
}


/*******************************************************************************
* Function Name: Cy_SMIF_Memslot_SfdpDetect
****************************************************************************//**
*
* This function detects the device signature for SFDP devices.
* Refer to the SFDP spec (JESD216B) for details.
* The function asks the device using an SPI and then populates the relevant
* parameters for \ref cy_stc_smif_mem_device_cfg_t.
*
* \note This function is a blocking function and blocks until the structure data
* is read and returned. This function uses \ref Cy_SMIF_TransmitCommand()
* If there is no support for SFDP in the memory device, the API returns an
* error condition. The function requires:
*   - SMIF initialized and enabled to work in the normal mode;
*   - readSfdpCmd field of \ref cy_stc_smif_mem_device_cfg_t is enabled.
*
* \note The SFDP detect takes into account the types of the SPI supported by the
* memory device and also the dataSelect option selected to choose which SPI mode
* (SPI, DSPI, QSPI) to load into the structures. The algorithm prefers
* QSPI>DSPI>SPI, provided there is support for it in the memory device and the
* dataSelect selected by the user.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param device
* The device structure instance declared by the user. This is where the detected
* parameters are stored and returned.
*
* \param slaveSelect
* The slave select line for the device.
*
* \param dataSelect
* The data line selection options for a slave device.
*
* \param context
* Internal SMIF context data.
*
* \return A status of the transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_NO_SFDP_SUPPORT
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Memslot_SfdpDetect(SMIF_Type *base,
                                    cy_stc_smif_mem_device_cfg_t *device,
                                    cy_en_smif_slave_select_t slaveSelect,
                                    cy_en_smif_data_select_t dataSelect,
                                    cy_stc_smif_context_t *context)
{
    /* Check the input parameters */
    CY_ASSERT_L1(NULL != device);
    
    uint8_t sfdpBuffer[CY_SMIF_SFDP_LENGTH];
    uint8_t sfdpAddress[CY_SMIF_SFDP_ADDRESS_LENGTH] = {0x00U, 0x00U, 0x00U};
    cy_en_smif_status_t result = CY_SMIF_NO_SFDP_SUPPORT;
    cy_stc_smif_mem_cmd_t *cmdSfdp = device->readSfdpCmd;

    /* Initialize the SFDP buffer */
    for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
    {
        sfdpBuffer[i] = 0U;
    }
    
    /* Slave slot initialization */
    Cy_SMIF_SetDataSelect(base, slaveSelect, dataSelect);

    if (NULL != cmdSfdp)
    {
        /* Get the SDFP header and all parameter headers content into sfdpBuffer[] */
        result = SfdpReadBuffer(base, 
                               cmdSfdp,
                               sfdpAddress,
                               slaveSelect,
                               HEADERS_LENGTH,
                               sfdpBuffer,
                               context);
    }
    
    /* Check if we support all parameter headers */
    if ((CY_SMIF_SUCCESS == result) && 
       (sfdpBuffer[PARAM_HEADERS_NUM] > PARAM_HEADER_NUM))
    {
        result = CY_SMIF_NO_SFDP_SUPPORT;
    }

    if (CY_SMIF_SUCCESS == result)
    {
        if((sfdpBuffer[CY_SMIF_SFDP_SING_BYTE_00] == (uint8_t)'S') &&
         (sfdpBuffer[CY_SMIF_SFDP_SING_BYTE_01] == (uint8_t)'F') &&
         (sfdpBuffer[CY_SMIF_SFDP_SING_BYTE_02] == (uint8_t)'D') &&
         (sfdpBuffer[CY_SMIF_SFDP_SING_BYTE_03] == (uint8_t)'P') &&
         (sfdpBuffer[CY_SMIF_SFDP_MINOR_REV] >= CY_SMIF_SFDP_JEDEC_REV_B) &&
         (sfdpBuffer[CY_SMIF_SFDP_MAJOR_REV] == CY_SMIF_SFDP_MAJOR_REV_1))
        {
            /* Find JEDEC SFDP Basic SPI Flash Parameter Header */
            uint32_t id = (BASIC_SPI_ID_MSB << BITS_IN_BYTE) |
                           BASIC_SPI_ID_LSB;
            uint32_t basicSpiTableLength;
            result = SfdpFindParameterTableAddress(id,
                                               sfdpBuffer,
                                               sfdpAddress,
                                               &basicSpiTableLength);
          
