ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_smif_memslot.c
            if (CY_SMIF_SUCCESS == result)
            { 
                /* Get the JEDEC basic flash parameter table content into sfdpBuffer[] */
                result = SfdpReadBuffer(base, 
                                       cmdSfdp,
                                       sfdpAddress,
                                       slaveSelect,
                                       basicSpiTableLength,
                                       sfdpBuffer,
                                       context);

                /* The number of address bytes used by the memory slave device */
                device->numOfAddrBytes = SfdpGetNumOfAddrBytes(sfdpBuffer);

                /* The external memory size */
                device->memSize = SfdpGetMemoryDensity(sfdpBuffer);
             
                /* The page size */
                device->programSize = SfdpGetPageSize(sfdpBuffer);

                /* This specifies the Read command. The preference order Quad>Dual>SPI */
                cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;
                SfdpGetReadCmdParams(sfdpBuffer, dataSelect, cmdRead);

                /* The Write Enable command */
                SfdpSetWriteEnableCommand(device->writeEnCmd);               

                /* The Write Disable command */
                SfdpSetWriteDisableCommand(device->writeDisCmd); 
                
                /* The program command */
                SfdpSetProgramCommand(device->programCmd); 

                /* The busy mask for the status registers */
                device->stsRegBusyMask = CY_SMIF_STS_REG_BUSY_MASK;
                            
                /* The command to read the WIP-containing status register */
                SfdpSetWipStatusRegisterCommand(device->readStsRegWipCmd);

                /* The command to write into the QE-containing status register */
                SfdpGetQuadEnableParameters(device, sfdpBuffer);

                /* Chip Erase command */
                SfdpSetChipEraseCommand(device->chipEraseCmd);
                
                /* Find the sector Erase command type with 3-bytes addressing */
                uint32_t eraseTypeOffset;
                eraseTypeOffset = SfdpGetSectorEraseCommand(device->eraseCmd, sfdpBuffer);
                
                /* The Erase sector size */
                device->eraseSize = (0x01UL << (uint32_t)sfdpBuffer[eraseTypeOffset - 1UL]);

                /* Erase Time Type */
                device->eraseTime = SfdpGetEraseTime(eraseTypeOffset, sfdpBuffer);
                
                /* Chip Erase Time */
                device->chipEraseTime = SfdpGetChipEraseTime(sfdpBuffer);

                /* Page Program Time */
                device->programTime = SfdpGetPageProgramTime(sfdpBuffer);
            }
        }
        else
        {
            result = CY_SMIF_NO_SFDP_SUPPORT;
        }
    }

    return(result);
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSMIF */

/* [] END OF FILE */
